---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DetailFailures.EavesAreAligned
source: html/1253d766-2e0f-3b6e-8647-bb8b20aa7efe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DetailFailures.EavesAreAligned Property

All eaves are already aligned.

## Syntax (C#)
```csharp
public static FailureDefinitionId EavesAreAligned { get; }
```